Revit 2027 API
CurveByPointsArray.ReverseIterator Method
Retrieve a backward moving iterator to the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual CurveByPointsArrayIterator ReverseIterator()
Public Overridable Function ReverseIterator As CurveByPointsArrayIterator
public:
virtual CurveByPointsArrayIterator^ ReverseIterator()
abstract ReverseIterator : unit -> CurveByPointsArrayIterator
override ReverseIterator : unit -> CurveByPointsArrayIterator
Return Value
CurveByPointsArrayIterator
Returns a backward moving iterator to the array.
See Also
Reference
CurveByPointsArray Class
Autodesk.Revit.DB Namespace